Repository: KDE/konqueror
Catalog: po/*/kcmbookmarks.po
Languages: eo

source: Bookmarks
eo: Legosignoj

source: If this option is unchecked, bookmarks at the root of the hierarchy (not in a folder) are not displayed. If checked, they are gathered in a "root" folder.
eo: Se ĉi tiu opcio estas nemarkita, legosignoj ĉe la radiko de la hierarkio (ne en dosierujo) ne estas montrataj. Se markite, ili estas kolektitaj en dosierujo "radiko".

source: &Show bookmarks without folder
eo: Montri lego&signojn sen dosierujo

source: Sub-folders are shown within their parent by default. If you activate this option, sub-folders are displayed on their own. It looks less nice but it may help if you have a very big folder you want to spread in two columns.
eo: Subdosierujoj estas montritaj ene de sia gepatro defaŭlte. Se vi aktivigas ĉi tiun opcion, subdosierujoj montriĝas memstare. Ĝi aspektas malpli bela sed eble helpos se vi havas tre grandan dosierujon, kiun vi volas disvastigi en du kolumnoj.

source: &Flatten bookmarks tree
eo: &Platigi legosignan arbon

source: Show a box with KDE places (Home, Network, ...). Useful if you use konqueror as a file manager.
eo: Montru skatolon kun KDE-lokoj (Hejmo, Reto, ...). Utila se vi uzas konqueror kiel dosieradministranton.

source: Show system &places
eo: Montri sistem&lokojn

source: General Settings
eo: Ĝeneralaj Agordoj

source: Folders are automatically distributed in several columns. The optimal number of columns depends on the width of the konqueror window and the number of bookmarks you have.
eo: Dosierujoj estas aŭtomate distribuitaj en pluraj kolumnoj. La optimuma nombro da kolumnoj dependas de la larĝo de la konqueror-fenestro kaj la nombro da legosignoj kiujn vi havas.

source: Number of columns to show:
eo: Nombro de kolumnoj montrendaj:

source: Disable it on slow system to disable background images.
eo: Malebligu ĝin en malrapidaj sistemoj por malebligi fonbildojn.

source: Show folder &backgrounds
eo: Montri dosierujajn &fonojn

source: How much disk space is used to cache the pixmaps
eo: Kiom da diskospaco estas uzata por kaŝmemorigi pikselmapojn

source: Pixmap Cache
eo: Pikselmapa Kaŝmemoro

source: Disk cache size:
eo: Surdiska kaŝmemora grando:

source: Clear the pixmap cache
eo: Viŝi la pikselmapan kaŝmemoron

source: &Clear Cache
eo: &Malplenigi la kaŝmemoron
