Repository: KDE/konqueror
Catalog: po/*/kfmclient.po
Languages: ar, eo

# NAME OF TRANSLATORS
source: Your names
ar: زايد السعيدي
eo: Wolfram Diestel,Cindy McKee,Oliver Kellogg

# EMAIL OF TRANSLATORS
source: Your emails
ar: zayed.alsaidi@gmail.com
eo: wolfram@steloj.de,cfmckee@gmail.com,olivermkellogg@gmail.com

source: KDE tool for opening URLs from the command line
ar: أداة كِيدِي لفتح العناوين من سطر الأوامر
eo: KDE-programo por malfermi URLojn de la komandlinio

source: Non interactive use: no message boxes
ar: لا استخدام تفاعلي: لا حواريات
eo: Neinteraga uzo: neniuj mesaĝaj dialogujoj

source: Show available commands
ar: أظهر الأوامر المتوفّرة
eo: Montras uzeblajn komandojn

source: The mimetype of the URL. Allows Konqueror to determine in advance which component to use, making it start faster.
ar: نوع MIME الخاص بعنوان URL. يسمح لبرنامج كنكر بتحديد المكون الذي سيُستخدم مسبقًا، مما يجعله يبدأ بشكل أسرع.
eo: La mime-speco de la URL. Permesas al Konqueror anticipe determini kiun komponanton uzi, igante ĝin komenci pli rapide.

# the name for a the value of an option on the command line help
source: type
ar: النوع
eo: tipo

source: Command (see --commands)
ar: الأمر (طالع ‎--commands)
eo: Komando (vd. --commands)

source: Arguments for command
ar: معطيات الأمر
eo: Argumentoj por komando

source: The files/URLs opened by the application will be deleted after use
ar: المستندات والعناوين التي يفتحها التّطبيق ستُحذف بعد استخدامها
eo: La dosieroj/URL malfermitaj de la aplikaĵo estos forigitaj post uzo

source: Syntax:
ar: الصياغة:
eo: Sintakso:

source: kfmclient openURL 'url' ['mimetype'] # Opens a window showing 'url'. # 'url' may be a relative path # or file name, such as . or subdir/ # If 'url' is omitted, the start page is shown.
ar: kfmclient openURL 'url' ['mimetype'] # يفتح نافذة تُظهر 'url'. # قد يكون 'url' مسارًا نسبيًا # أو اسم ملف، مثل . أو subdir/‎ # إذا أُسقط 'url'، سيُستخدَم صفحة البداية بدلًا منه.
eo: kfmclient openURL 'url' ['mimetype'] # Malfermas fenestron montrante 'url'. # 'url' povas esti relativa vojo # aŭ dosiernomo, ekz. '.' aŭ subdosierujo/ # Se 'url' estas forlasata, la komenca paĝo estas montrata.

source: # If 'mimetype' is specified, it will be used to determine the # component that Konqueror should use. For instance, set it to # text/html for a web page, to make it appear faster # Note: this way of specifying mimetype is deprecated. # Please use the --mimetype option
ar: # إذا حُدِّد 'mimetype'، سيُستخدَم لتحديد المكوّن الذي يجب # أن يستخدمه كنكر. مثلًا استخدم text/html لصفحة وِب، # لتظهر بشكل أسرع # ملاحظة: هذه الطريقة لتحديد نوع mimetype أصبحت قديمة. # يرجى استخدام خيار --mimetype
eo: # Se 'mime-tipo' estas donita, ĝi estos uzata por eltrovi la # komponanton, kiun Konkeranto uzu. Ekzemple, difinu ĝin al # text/html por TTT-paĝo, por aperigi ĝin pli rapide # Rimarku: ĉi maniero por specifi mimetype estas malrekomendita. # Bonvolu uzi la opcion --mimetype

source: kfmclient newTab 'url' ['mimetype'] # Same as above but opens a new tab with 'url' in an existing Konqueror # window on the current active desktop if possible.
ar: kfmclient newTab 'url' ['mimetype'] # كما الذي في الأعلى، لكن هذا يفتح لسان جديد بِـ 'url' في نافذة موجودة # مسبقًا في كنكر على سطح المكتب النشط إذا كان ممكنًا.
eo: kfmclient newTab 'url' ['mime-tipo'] # Same kiel la supra, sed malfermas novan langeton kun 'url' en jam ekzistanta fenestro de # Konkeranto sur la aktiva labortablo, se tio estas ebla.

source: Syntax error, not enough arguments
ar: خطأ صياغي، لا معطيات كافية
eo: Sintaksa eraro, ne sufiĉas argumentoj

source: Syntax error, too many arguments
ar: خطأ صياغي، الكثير من المعطيات
eo: Sintaksa eraro, tro da argumentoj

source: Syntax error, unknown command '%1'
ar: خطأ صياغي: الأمر '%1' مجهول
eo: Sintaks-eraro, nekonata komando '%1'
