Repository: KDE/konqueror
Catalog: po/*/konqsidebar.po
Languages: gl

# @action:inmenu Add
source: Bookmarks Sidebar Module
gl: Módulo da barra lateral de marcadores

# @title:tab
source: Bookmarks
gl: Marcadores

source: Default action
gl: Acción predeterminada

source: Default action when double clicking an URL
gl: Acción predeterminada ao facer clic duplo nun URL.

source: Limits
gl: Límites

source: URLs e&xpire after
gl: O URL caduca tra&s

source: Maximum &number of URLs:
gl: &Número máximo de URL:

source: Custom Fonts For
gl: Fontes personalizadas para

source: URLs newer than
gl: URL anteriores a

source: Choose Font...
gl: Escoller a fonte…

source: URLs older than
gl: URL posteriores a

source: Details
gl: Detalles

source: Shows the number of times visited and the dates of the first and last visits, in addition to the URL
gl: Amosa o número de veces que se visitou e as datas da primeira e da última visita, ademais do URL.

source: Detailed tooltips
gl: Mensaxes emerxentes detalladas.

source: Clear History
gl: Borrar o historial

# @action:inmenu Add
source: History Sidebar Module
gl: Módulo da barra lateral co historial

# @title:tab
source: History
gl: Historial

# Automatically decide which action to perform
source: Auto
gl: Automática

# Open URL in new tab
source: Open in new tab
gl: Abrir nunha lapela

# Open URL in current tab
source: Open in current tab
gl: Abrir na lapela actual

# Open URL in new window
source: Open in new window
gl: Abrir nunha nova xanela

source: Action to carry out when opening an URL from history:<dl><dl><dt>Auto:</dt><dd>opens the URL in a new tab unless the current tab is empty or an intro page</dd><dt>Open URL in a new tab:</dt><dd>always opens the URL in a new tab</dd><dt>Open URL in current tab:</dt><dd>always opens the URL in the current tab</dd><dt>Open URL in new window:</dt><dd>always opens the URL in a new window</dd></dl>
gl: Acción a realizar ao abrir un URL do historial:<dl><dl><dt>Automática:</dt><dd>Abre o URL nunha lapela a menos que a lapela actual estea baleira ou sexa a páxina de inicio.</dd><dt>Abrir nunha lapela:</dt><dd>Abre sempre o URL nunha nova lapela.</dd><dt>Abrir na lapela actual:</dt><dd>Abre sempre o URL na lapela actual.</dd><dt>Abrir o URL nunha nova xanela:</dt><dd>Abre sempre o URL nunha nova xanela.</dd></dl>

source: days
gl: días

source: Minute
gl: Minuto

source: Day
gl: Día

source: Do you really want to clear the entire history?
gl: Seguro que quere borrar todo o historial?

# @title:window
source: Clear History?
gl: Quere borrar o historial?

# @action:inmenu Add
source: Places Sidebar Module
gl: Módulo da barra lateral de lugares

# @title:tab
source: Places
gl: Lugares

source: Restore All Removed Default Buttons
gl: Restaurar os botóns predeterminados retirados

source: Rollback to System Default
gl: Regresar á predeterminada do sistema

source: Configure Sidebar
gl: Configurar a barra lateral

source: Add New
gl: Engadir unha nova

source: Multiple Views
gl: Varias vistas

source: Show Tabs on Left
gl: Amosar as lapelas na esquerda

source: Show Configuration Button
gl: Amosar o botón de configuración

source: Close Sidebar
gl: Pechar a barra lateral

source: This entry already exists.
gl: A entrada xa existe.

source: <qt>This removes all your entries from the sidebar and adds the system default ones.<br /><b>This procedure is irreversible.</b><br />Do you want to proceed?</qt>
gl: <qt>Isto retira todas as entradas da barra lateral e engade as predeterminadas do sistema.<br /><b>O procedemento é irreversíbel.</b><br />Quere proceder?</qt>

source: Show Tabs on Right
gl: Amosar as lapelas na dereita

# @title:window
source: Set Name
gl: Definir o nome

source: Enter the name:
gl: Escriba o nome:

source: Enter a URL:
gl: Insira o URL:

source: <qt>Do you really want to remove the <b>%1</b> tab?</qt>
gl: <qt>Seguro que quere retirar a lapela <b>%1</b>?</qt>

source: You have hidden the sidebar configuration button. To make it visible again, click the right mouse button on any of the sidebar buttons and select "Show Configuration Button".
gl: Agochou o botón de configuración da barra lateral. Para facelo visíbel de novo, prema o botón dereito do rato sobre calquera botón da barra lateral e seleccione «Amosar o botón de configuración».

source: Set Name...
gl: Definir o nome…

source: Set URL...
gl: Definir o URL…

source: Set Icon...
gl: Definir a icona…

source: Show Hidden Folders...
gl: Amosar os cartafoles agochados…

source: Remove
gl: Retirar

source: Web module
gl: Módulo web

# @action:inmenu Add
source: Tree Sidebar Module
gl: Módulo da barra lateral de árbore

# @title:tab
source: Tree
gl: Árbore

# @action:inmenu Add
source: Vertical Tab Bar
gl: Barra de separadores vertical

# @title:tab
source: Tabs
gl: Lapelas

source: &Open Link
gl: &Abrir a ligazón

source: Open in New &Window
gl: Abrir nunha &xanela nova

source: &Reload
gl: &Recargar

source: Set &Automatic Reload
gl: Definir a recarga &automática

# @title:window
source: Set Refresh Timeout (0 disables)
gl: Definir o tempo límite de actualización (0 desactívao)

source: minute
gl: minuto

source: second
gl: segundo

# @action:inmenu Add
source: Web Sidebar Module
gl: Módulo da barra lateral web

# @label
source: Name:
gl: Nome:

# @label
source: Path or URL:
gl: Ruta ou URL:

# @title:window
source: Add web sidebar module
gl: Engadir un módulo de barra lateral web
