Repository: KDE/konqueror
Catalog: po/*/speeddial.po
Languages: bg

source: &Name
bg: &Име

source: The name you want displayed on the Speed Dial button
bg: Името, което искате да се показва на бутона за бърз достъп

source: &Url
bg: &Адрес

source: Icon
bg: Икона

source: Use favicon
bg: Използване на уеб иконата

source: Use local icon
bg: Използване на локална икона

source: Use remote icon
bg: Използване на отдалечена икона

source: Name
bg: Име

source: Url
bg: Адрес

source: Do you want to delete "%1"?
bg: Искате ли да изтриете „%1“?

source: Speed dial entries
bg: Елементи на бърз достъп

source: Add entry…
bg: Добавяне на елемент…

source: Edit entry…
bg: Редактиране на елемент…

source: Remove entry
bg: Премахване на елемент

source: Move up
bg: Преместване нагоре

source: Move down
bg: Преместване надолу
