Repository: KDE/konqueror
Catalog: po/*/webarchiver.po
Languages: ar, gl

# NAME OF TRANSLATORS
source: Your names
ar: زايد السعيدي
gl: Adrián Chaves (Gallaecio)

# EMAIL OF TRANSLATORS
source: Your emails
ar: zayed.alsaidi@gmail.com
gl: adrian@chaves.gal

source: Create Archive
ar: أنشئ أرشيفًا
gl: Crear un arquivo

source: The URL of the page that is to be archived
ar: عنوان URL للصفحة التي ستُأرشف
gl: O URL da páxina para arquivar.

source: Source &URL:
ar: عنوان ال&مصدر:
gl: &URL de orixe:

source: Web archive (*.war)
ar: أرشيف ويب (*.war)
gl: Arquivo web (*.war)

source: Tar archive (*.tar)
ar: أرشيف تار (*.tar)
gl: Arquivo tar (*.tar)

source: Zip archive (*.zip)
ar: أرشيف Zip مضغوط (‎*.zip)
gl: Arquivo zip (*.zip)

source: Directory
ar: الدّليل
gl: Cartafol

source: The file or directory where the archived page will be saved
ar: الملف أو الدليل الذي ستحفظ الصفحة المؤرشفة فيه
gl: O ficheiro ou cartafol onde gardar a páxina arquivada.

source: &Save to:
ar: ا&حفظ في:
gl: &Gardar en:

source: Options
ar: خيارات
gl: Opcións

source: second
ar: ثانية
gl: segundo

source: None
ar: بلا
gl: Ningún

# @info
source: The web archive download cannot use the current proxy settings. No proxy will be used.
ar: لا يمكن لتنزيل أرشيف الويب استخدام إعدادات الوكيل الحالية. لن يستخدم أي وكيل.
gl: A descarga do arquivo web non pode usar a configuración actual de mandatario. Non se usará ningún mandatario.

# @info
source: The save location is not valid.
ar: موقع الحفظ غير صالح.
gl: A localización de garda non é válida.

# @info
source: Cannot find the wget(1) command,<nl/>see <link>%1</link>.
ar: لا يمكن العثور على الأمر wget(1)،<nl/>راجع <link>%1</link>.
gl: Non é posíbel atopar a orde wget(1),<nl/>consulte <link>%1</link>.

# @info
source: Cannot verify destination<nl/><filename>%1</filename><nl/>%2
ar: لا يمكن التحقق من المقصد<nl/><filename>%1</filename><nl/>%2
gl: Non é posíbel verificar o destino<nl/><filename>%1</filename><nl/>%2

# @info
source: The archive directory<nl/><filename>%1</filename><nl/>already exists as a file.
ar: دليل الأرشيف<nl/><filename>%1</filename><nl/>موجود فعلًا كملف.
gl: O cartafol do arquivo<nl/><filename>%1</filename><nl/>xa existe como ficheiro.

# @info
source: The archive directory<nl/><filename>%1</filename><nl/>already exists.
ar: دليل الأرشيف<nl/><filename>%1</filename><nl/>موجود فعلًا.
gl: O cartafol do arquivo<nl/><filename>%1</filename><nl/>xa existe.

# @info
source: The archive file<nl/><filename>%1</filename><nl/>already exists as a directory.
ar: ملف الأرشيف<nl/><filename>%1</filename><nl/>موجود فعلًا كدليل.
gl: O ficheiro de arquivo<nl/><filename>%1</filename><nl/>xa existe como cartafol.

# @info
source: The archive file <nl/><filename>%1</filename><nl/>already exists.
ar: لف الأرشيف <nl/><filename>%1</filename><nl/>موجود فعلًا.
gl: O ficheiro de arquivo<nl/><filename>%1</filename><nl/>xa existe.

source: Archive Already Exists
ar: الأرشيف موجود فعلًا
gl: O arquivo xa existe

# @info
source: Cannot delete original archive<nl/><filename>%1</filename><nl/>%2
ar: لا يمكن حذف الأرشيف الأصلي<nl/><filename>%1</filename><nl/>%2
gl: Non é posíbel eliminar o arquivo orixinal<nl/><filename>%1</filename><nl/>%2

# @info
source: Cannot create a temporary directory<nl/><filename>%1</filename><nl/>
ar: لا يمكن إنشاء دليل مؤقت<nl/><filename>%1</filename><nl/>
gl: Non é posíbel crear un directorio temporal<nl/><filename>%1</filename><nl/>

# @info
source: Cannot start the archiver process <filename>%1</filename>
ar: لا يمكن بدء عملية الأرشيف <filename>%1</filename>
gl: Non é posíbel iniciar o proceso de arquivador <filename>%1</filename>

# @info
source: The download process was interrupted.
ar: قُطعت عملية التنزيل.
gl: Interrompeuse o proceso de descarga.

# @info
source: <para>The download process <filename>%1</filename> failed with signal %2.</para>
ar: <para>فشلت عملية التنزيل <filename>%1</filename> مع الإشارة %2.</para>
gl: <para>O proceso de descarga <filename>%1</filename> fallou co sinal %2.</para>

# @info
source: <para>The download process <filename>%1</filename> failed with status %2.</para>
ar: <para>فشلت عملية التنزيل <filename>%1</filename> مع الحالة %2.</para>
gl: <para>O proceso de descarga <filename>%1</filename> fallou co estado %2.</para>

# @info
source: <para>This may simply indicate a 404 error for some of the page elements.</para>
ar: <para>قد يشير هذا ببساطة إلى خطأ 404 لبعض عناصر الصفحة.</para>
gl: <para>Isto podería indicar simplemente un erro 404 para algúns dos elementos da páxina.</para>

# @info
source: <para>Retain the partial web archive?</para>
ar: <para>الاحتفاظ بالأرشيف الجزئي للويب؟</para>
gl: <para>Manter o arquivo web parcial?</para>

source: Retain Archive?
ar: الاحتفاظ بالأرشيف؟
gl: Manter o arquivo?

source: Retain
ar: احتفظ
gl: Manter

# @info
source: Creating the web archive failed.
ar: فشل إنشاء أرشيف الويب.
gl: A creación do arquivo web fallou.

# @info
source: Cannot copy archive to<nl/><filename>%1</filename><nl/>%2
ar: لا يمكن نسخ الأرشيف إلى<nl/><filename>%1</filename><nl/>%2
gl: Non é posíbel copiar o arquivo en<nl/><filename>%1</filename><nl/>%2

# @info
source: Cannot set permissions on<nl/><filename>%1</filename><nl/>%2
ar: لا يمكن تعيين الأذونات على<nl/><filename>%1</filename><nl/>%2
gl: Non é posíbel definir os permisos en<nl/><filename>%1</filename><nl/>%2

# @info
source: Web archive saved as<nl/><filename><link>%1</link></filename>
ar: حُفظ أرشيف الويب باسم<nl/><filename><link>%1</link></filename>
gl: O arquivo web gardouse como<nl/><filename><link>%1</link></filename>

source: Web Archiver
ar: مؤرشف الويب
gl: Arquivador web

source: Archive a web page
ar: أرشفة صفحة ويب
gl: Arquivar unha páxina web

source: Copyright (c) 2020 Jonathan Marten
ar: حقوق النشر (ج) 2020 لجوناثان مارتن
gl: © 2020 Jonathan Marten

source: Jonathan Marten
ar: جوناثان مارتن

source: URL of the web page to archive
ar: عنوان URL لصفحة الويب المراد أرشفتها
gl: URL da páxina web que arquivar.

source: url
ar: رابط

source: Wait time:
ar: وقت الانتظار:
gl: Tempo de espera:

source: The wait time between item requests, to reduce web server load
ar: وقت الانتظار بين طلبات العناصر لتقليل تحميل خادم الويب
gl: Tempo de espera entre solicitudes de elementos, para reducir a carga sobre o servidor web.

source: Do not use proxy
ar: لا تستخدم الوكيل
gl: Non usar un mandatario.

source: Do not use the system proxy settings to fetch the web page
ar: لا تستخدم إعدادات وكيل النظام لجلب صفحة الويب
gl: Non usar a configuración de mandatario do sistema para obter a páxina web.

source: Randomise wait time
ar: وقت الانتظار العشوائي
gl: Tempo de espera aleatorio.

source: Vary the wait time between requests, to confuse server log analysis
ar: غيّر وقت الانتظار بين الطلبات للتشويش على تحليل سجل الخادم
gl: Variar o tempo de espera entre solicitudes, para dificultar a análise dos rexistros do servidor.

source: Save in standard web archive format
ar: احفظ بتنسيق أرشيف الويب القياسي
gl: Gardar nun formato de arquivo web estándar.

source: <p>Save downloaded files all in a single directory, with file name extensions suitable for local browsing. For example, the main HTML page will always be called "index.html" and a remote .php page will be saved with the standard .html extension.</p> <p>Leave this option turned on to produce a standard web archive (.war) file.</p> <p>If this option is turned off, then the files will be saved exactly as downloaded. This means that they may be in subdirectories reflecting the structure of the original web site, and extensions will not be adjusted. Note that the download may not work correctly if the original URL refers to a directory but does not end with a slash.</p>
ar: <p>احفظ الملفات التي المنزلة كلها في دليل واحد، مع امتدادات اسم الملف المناسبة للتصفح المحلي. على سبيل المثال، سيتم دائمًا تسمية الصفحة الرئيسية HTML باسم "index.html" وستُحفظ صفحة .php عن بُعد بالامتداد القياسي .html.</p> <p>اترك هذا الخيار قيد التشغيل لإنتاج ملف أرشيف ويب قياسي (.war).</p> <p>إذا عُطل هذا الخيار، فستُحفظ الملفات تمامًا مثل ما نزلت. هذا يعني أنها قد تكون في أدلة فرعية تعكس بنية موقع الويب الأصلي، ولن يعدل الامتدادات. لاحظ أن التنزيل قد لا يعمل بشكل صحيح إذا كان عنوان URL الأصلي يشير إلى دليل ولكنه لا ينتهي بعلامة مائلة.</p>
gl: <p>Gardar todos os ficheiros descargados nun mesmo cartafol, coas extensións de nome de ficheiro axeitadas para a navegación local. Por exemplo, a páxina HTML principal chámase sempre «index.html» e unha páxina «.php» remota gardaríase coa extensión estándar «.html».</p> <p>Deixe esta opción activada para producir un ficheiro de arquivo web estándar (.war).</p> <p>Se desactiva esta opción, os ficheiros gardaranse como se descarguen. Isto significa que poderían estar en subcartafoles que reflictan a estrutura do sitio web orixinal, e as extensións non se axustarán. Teña en conta que a descarga podería non funcionar correctamente se o URL orixinal fai referencia a un cartafol pero non remata nunha barra inclinada.</p>

source: Run in terminal
ar: شغّل في الطّرفيّة
gl: Executar nun terminal

source: <p>Run the download process in a terminal window. Close the terminal window when the download has finished.</p> <p>If this option is turned off then the download will run in the background. Its progress output should appear in the session log file.</p>
ar: <p>شغّل عملية التنزيل في نافذة الطرفية. أغلق نافذة الطرفية عند انتهاء التنزيل.</p> <p>إذا عُطل هذا الخيار، فسيشغل التنزيل في الخلفية. يجب أن يظهر ناتج تقدمه في ملف سجل الجلسة.</p>
gl: <p>Executar o proceso de descarga nunha xanela de terminal. Pechar a xanela de terminal cando remate a descarga.</p> <p>Se desactiva esta opción, a descarga executarase en segundo plano. A saída do seu progreso debería aparecer no ficheiro de rexistro da sesión.</p>

source: Close when finished
ar: أغلق عند الانتهاء
gl: Pechar ao rematar

source: Close this window when the download has finished successfully
ar: أغلق هذه النافذة عند انتهاء التنزيل بنجاح
gl: Pechar a xanela cando se complete a descarga.

source: Archive &type:
ar: نوع الأر&شيف:
gl: &Tipo de arquivo:

source: The type of web archive to save
ar: نوع أرشيف الويب المراد حفظه
gl: O tipo de arquivo web para gardar.

source: Archive Web Page...
ar: صفحة ويب الأرشيف...
gl: Arquivar a páxina web…

# @info
source: Cannot find the <command>kcreatewebarchive</command> executable,<nl/>check the plugin and helper installation.
ar: لا يمكن العثور على الملف القابل للتنفيذ <command>kcreatewebarchive</command>،<nl/>تحقق من تثبيت الملحق والمساعد.
gl: Non é posíbel atopar o executábel de <command>kcreatewebarchive</command>,<nl/>revise a instalación do complemento e do asistente.

source: Cannot Create Web Archive
ar: لا يمكن إنشاء أرشيف ويب
gl: Non é posíbel crear o arquivo web

source: &Tools
ar: أ&دوات
gl: Ferramen&tas

source: Extra Toolbar
ar: شريط أدوات إضافي
gl: Barra de ferramentas extra
